test_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:coun="http://www.classes.generated/countries">
   <soapenv:Header/>
   <soapenv:Body>
      <coun:getCountryRequest>
         <coun:name>Sample Country</coun:name>
      </coun:getCountryRequest>
   </soapenv:Body>
</soapenv:Envelope>
